<a href="https://colab.research.google.com/github/james-monahan/Code-school-notebooks/blob/main/Week-6-pandas-sql/Pandas_Part_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# Mission 1

![](https://i.imgur.com/Ax3pp2A.png)


Create a "fruit" dataframe that reflects the above example **using a list** data structure

In [ ]:
vals = [[30,21]]
cols = [['Apples', 'Bananas']]

df = pd.DataFrame(data=vals, columns=cols)
df

  Apples Bananas
0     30      21

# Mission 2

Create a "fruit_vendors" dataframe that reflects the below example **using a dictionary** data structure

![](https://i.imgur.com/CHPn7ZF.png)

In [ ]:
data = {'Apples': [35,41], 'Bananas': [21,34]}
idx = ['2017 Sales', '2018 Sales']
df = pd.DataFrame(data, index=idx)
df

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [ ]:
#Alternative
data = {'2017 Sales': [35,41], '2018 Sales': [21,34]}
cols = ['Apples','Bananas']
df = pd.DataFrame.from_dict(data, orient='index', columns=cols)
df

            Apples  Bananas
2017 Sales      35       41
2018 Sales      21       34

# Mission 3

Use a loop to display the values from each column in the dataframe from mission 2.

In [ ]:
#method 1
for i, val in df.iterrows():
  print(val)
print()
#method 2
for i in range(len(df)) : 
  print(df.iloc[i, 0], df.iloc[i, 1])

Apples     35
Bananas    41
Name: 2017 Sales, dtype: int64
Apples     21
Bananas    34
Name: 2018 Sales, dtype: int64

35 41
21 34

# Mission 4

Delete line 1 of the dataframe from mission 2

In [ ]:
df.drop(df.index[0:1,], inplace=True)
df

            Apples  Bananas
2018 Sales      21       34

# Mission 5

Delete column 1 from the dataframe from mission 2.

In [ ]:
df.drop(['Bananas'], axis=1, inplace=True)
df

            Apples
2018 Sales      21